
namespace Com.BitsQuan.Option.Core
{

    public enum AccountChangeType
    {
        CNY提现 = 1,
        现金冻结 = 2,
        保证金付款 = 3,
        保证金冻结 = 4,
        佣金支付 = 5,
        现金转保证金_现金转出 = 6,
        保证金转现金_保证金转出 = 7,


        现金转保证金 = 8,
        保证金转现金 = 9,


        CNY充值 = 10,
        保证金收款 = 11,
        现金解冻 = 13,
        保证金解冻 = 14,
        现金转保证金_保证金转入 = 15,
        保证金转现金_现金转入 = 16,
        BTC冻结 = 17,

        BTC提现 = 18,
        BTC充值 = 19,
        系统借款 = 20,
        系统还款 = 21,

        现金收款 = 22,
        现金付款 = 23,

        手动增加保证金 = 24,
        手动减少保证金 = 25,
        手动增加现金 = 26,
        手动减少现金 = 27,
        手动增加BTC = 28,
        手动减少BTC = 29,

        BTC解冻 = 30,
        行权划入 = 31,
        行权划出 = 32,

        BTC付款=33,
        BTC收款=34,

        亏损分摊=35,
        推荐用户交易手续费返还_划入=36,
        推荐用户奖金_划入=37

    }
}
